# Pandas library

In [1]:
import pandas as pd 
import numpy as np
pd.__version__ # know the pandas version

'2.0.3'

In [2]:
s=pd.Series([1,2,3,]) # one column
print(s)

0    1
1    2
2    3
dtype: int64

In [3]:
df=pd.DataFrame({
    "name": ["niha","prash"],
    "age":[12,34]})
df

    name  age
0   niha   12
1  prash   34

In [4]:
df=pd.read_csv(r"C:\Users\Ramya\OneDrive\Documents\dataset\data.csv")
df

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

In [5]:
df.to_csv('data.csv',index=False)

# Exploring data

In [6]:
df.head()

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
0,B.Yamuna,AIR,A,37,yamunalovely9@gmail.com,8897859569,95
1,P.Devi,AIR,A,58,gundrasivesaidurga@gmail.com,9347791232,97
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96

In [7]:
df.tail()

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
5,K.Sri Niharika,AIR,A,9,karresriniharika@gmail.com,6300408089,90
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94
7,P.Durga,AIR,A,24,durgarani@gmail.com,8466845651,89
8,P.Akhila,AIR,A,29,bottaakhila@gmail.com,8397941799,90
9,P.Neelima,AIR,A,36,pinapalaramesh@gmail.com,7386803023,93

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   NAME                  10 non-null     object
 1   CLASS                 10 non-null     object
 2   SECTION               10 non-null     object
 3   ROLLNO                10 non-null     int64
 4                  EMAIL  10 non-null     object
 5   PHNO                  10 non-null     int64
 6   MARKS                 10 non-null     int64
dtypes: int64(3), object(4)
memory usage: 692.0+ bytes

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   NAME                  10 non-null     object
 1   CLASS                 10 non-null     object
 2   SECTION               10 non-null     object
 3   ROLLNO                10 non-null     int64
 4                  EMAIL  10 non-null     object
 5   PHNO                  10 non-null     int64
 6   MARKS                 10 non-null     int64
dtypes: int64(3), object(4)
memory usage: 692.0+ bytes

In [11]:
df.shape

(10, 7)

In [12]:
df[2:5]

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
2,J.Ramya,AIR,A,52,jivvireddyramyasri@gmailcom,9676976652,90
3,K.Prasanthi,AIR,A,41,kesanakurthiprasanthi@gmail.com,7382934586,85
4,K.V. Niharika,AIR,A,54,karreveeraniharika@gmail.com,9182532802,96

In [13]:
df.columns

Index(['NAME', 'CLASS', 'SECTION', 'ROLLNO', '               EMAIL', 'PHNO',
       'MARKS'],
      dtype='object')

In [14]:
df.NAME

0          B.Yamuna
1            P.Devi
2          J.Ramya
3       K.Prasanthi
4     K.V. Niharika
5    K.Sri Niharika
6          Y.Kaveri
7           P.Durga
8          P.Akhila
9         P.Neelima
Name: NAME, dtype: object

In [15]:
df.ROLLNO

0    37
1    58
2    52
3    41
4    54
5     9
6     3
7    24
8    29
9    36
Name: ROLLNO, dtype: int64

In [16]:
df[['NAME','MARKS']]

             NAME  MARKS
0        B.Yamuna     95
1          P.Devi     97
2        J.Ramya      90
3     K.Prasanthi     85
4   K.V. Niharika     96
5  K.Sri Niharika     90
6        Y.Kaveri     94
7         P.Durga     89
8        P.Akhila     90
9       P.Neelima     93

In [17]:
df.MARKS

0    95
1    97
2    90
3    85
4    96
5    90
6    94
7    89
8    90
9    93
Name: MARKS, dtype: int64

In [18]:
df['NAME'].max()

'Y.Kaveri'

In [19]:
df['NAME'].min()

'B.Yamuna'

In [20]:
df['MARKS'].mean()

91.9

In [21]:
df['MARKS'].mode()

0    90
Name: MARKS, dtype: int64

In [23]:
df['NAME'].describe()

count           10
unique          10
top       B.Yamuna
freq             1
Name: NAME, dtype: object

In [24]:
df[df.NAME==df.NAME.max()]

,NAME,CLASS,SECTION,ROLLNO,EMAIL,PHNO,MARKS
6,Y.Kaveri,AIR,A,3,yendamurikaveri@gmail.com,7386015549,94

In [25]:
df.MARKS[df.NAME==df.NAME.max()]

6    94
Name: MARKS, dtype: int64